read_verilog and_gate.v
synth -top and_gate
write_verilog and_gate_netlist.v
write_json and_gate.json
